Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
#include <zephyr/types.h>
#include <stddef.h>
#include <string.h>
#include <errno.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/random/random.h>

/* Hardware includes */
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/sensor.h>

/* Bluetooth includes */
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/hci.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/gatt.h>

/* Storage includes (NVS) */
#include <zephyr/fs/nvs.h>
#include <zephyr/storage/flash_map.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/settings/settings.h>
#include <zephyr/arch/cpu.h>

/* ДОДАНО: Бібліотека для ШИМ (PWM) */
#include <zephyr/drivers/pwm.h>
#include <zephyr/devicetree/pwms.h>
#include <hal/nrf_gpio.h>
#include <hal/nrf_power.h>

/* ДОДАНО: Бібліотека для Battary manegement */
#include <zephyr/drivers/adc.h>
#include <zephyr/bluetooth/services/bas.h>

/* Event system */
#include "app_events.h"
#include "app_sm.h"
#include "hog.h"

#define DEBUG_ENCODER_LOG 0
#define DEBUG_INACTIVITY_LOG 0
#define ENCODER_WHEEL_SEND_RELEASE 1
/* Set to 0 temporarily to isolate matrix wake leakage in SYSTEM OFF. */
#define SYSTEM_OFF_WAKE_ON_MATRIX 1

/* ========================================================================== *
 * 0. ГЛОБАЛЬНІ ЗМІННІ ТА НАЛАШТУВАННЯ АПАРАТНОЇ ЧАСТИНИ
 * ========================================================================== */
#define ZEPHYR_USER_NODE DT_PATH(zephyr_user)

static const struct gpio_dt_spec cols[] = {
    GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, col0_gpios),
    GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, col1_gpios),
    GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, col2_gpios),
    GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, col3_gpios),
};
static const struct gpio_dt_spec rows[] = {
    GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, row0_gpios),
    GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, row1_gpios),
    GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, row2_gpios),
};
static const struct device *const qdec_dev = DEVICE_DT_GET(DT_NODELABEL(qdec));
static const struct gpio_dt_spec enc_btn = GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, enc_btn_gpios);
static const struct adc_dt_spec battery_adc = ADC_DT_SPEC_GET_BY_IDX(ZEPHYR_USER_NODE, 0);

static int16_t battery_adc_raw;

#define NUM_COLS ARRAY_SIZE(cols)
#define NUM_ROWS ARRAY_SIZE(rows)
/* Number of consecutive identical reads required to consider a key stable */
#define DEBOUNCE_STABLE_SCANS 5
#define MATRIX_SETTLE_NOP_CYCLES 8
/* Divider correction factor from measured values: 3.938 V battery -> 2.089 V at ADC pin */
#define BATTERY_VOLTAGE_DIVIDER_NUM 1885
#define BATTERY_VOLTAGE_DIVIDER_DEN 1000
#define QDEC_A_PIN NRF_GPIO_PIN_MAP(0, 9)
#define QDEC_B_PIN NRF_GPIO_PIN_MAP(0, 10)
#define BATTERY_ADC_PIN NRF_GPIO_PIN_MAP(0, 31)

#define BATTERY_UPDATE_INTERVAL_MS (60U * 1000U)

static uint32_t last_battery_update_time = 0;

/* Стан кнопок */
/* key_state: debounced (stable) state exposed to the rest of the app */
static bool key_state[NUM_ROWS][NUM_COLS] = {false};
/* last_raw: last instantaneous raw read of the matrix line */
static bool key_last_raw[NUM_ROWS][NUM_COLS] = {false};
/* debounce counters: increment when raw == last_raw, reset when differs */
static uint8_t key_debounce_count[NUM_ROWS][NUM_COLS] = {0};
static bool enc_btn_state = false;
static bool enc_btn_last_raw = false;
static uint8_t enc_btn_debounce_count = 0;
static bool combo_unpair_done = false;
static bool power_save_active = false;
static bool input_scan_enabled = true;
static bool backlight_was_on_before_sleep = true;
static uint32_t last_activity_time = 0;
/* Default sleep timeout in minutes (integer minutes). Use 10 minutes by default. */
static uint8_t sleep_timeout_minutes = 1;

/* ДИНАМІЧНА РОЗКЛАДКА (Без const, щоб можна було перезаписувати) */
/* Типи дій, які може виконувати кнопка або енкодер */
#define ACTION_TYPE_NONE     0
#define ACTION_TYPE_KEY      1  /* Звичайна клавіатура (з модифікаторами Ctrl, Shift) */
#define ACTION_TYPE_MOUSE    2  /* Миша (кліки або скрол) */
#define ACTION_TYPE_MEDIA    3  /* Медіа (Гучність, Play/Pause) - на майбутнє */
#define ACTION_TYPE_LIGHT    4  /* ДОДАНО: Керування підсвіткою (код 1 - яскравіше, код 2 - тьмяніше) */
#define ACTION_TYPE_SEQUENCE 5  /* Виконати збережену послідовність */

/* Структура однієї дії (3 байти) */
typedef struct __packed{
    uint8_t type; /* Тип дії (ACTION_TYPE_KEY, ACTION_TYPE_MOUSE, тощо) */
    uint8_t mod;  /* Модифікатори (наприклад, 0x01 для Ctrl). Для миші - нуль. */
    uint8_t code; /* Скан-код клавіші (наприклад, 0x04 для 'A') або дельта скролу */
} Action_t;

#define PROFILE_NAME_LEN 16
#define MAX_PROFILES 3 /* Для початку зробимо 3 профілі, щоб зекономити RAM */

/* Структура цілого профілю */
typedef struct __packed{
    char name[PROFILE_NAME_LEN];              /* Назва профілю ("Photoshop", "Coding") */
    Action_t matrix[NUM_ROWS][NUM_COLS];      /* Дії для 12 кнопок (3x4) */
    Action_t enc_btn;                         /* Дія для натискання енкодера */
    Action_t enc_cw;                          /* Дія для повороту за годинниковою (Clockwise) */
    Action_t enc_ccw;                         /* Дія для повороту проти годинникової (Counter-CW) */
} Profile_t;

static void handle_local_action(Action_t act);
static void execute_sequence(uint8_t idx);

/* ДОДАНО: Керування підсвіткою */
static const struct pwm_dt_spec backlight = PWM_DT_SPEC_GET(DT_NODELABEL(backlight_led));
static const struct gpio_dt_spec backlight_gpio = GPIO_DT_SPEC_GET(ZEPHYR_USER_NODE, backlight_gpios);
static uint8_t current_brightness = 50; /* За замовчуванням 50% */

static bool backlight_on = true; /* Поточний стан підсвітки */

static void battery_init(void)
{
    if (!adc_is_ready_dt(&battery_adc)) {
        printk("Battery: ADC device not ready\n");
        return;
    }

    int err = adc_channel_setup_dt(&battery_adc);
    if (err) {
        printk("Battery: ADC channel setup failed, err %d\n", err);
        return;
    }

