Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
    printk("Battery: ADC initialized on AIN7 / P0.31\n");
}

static uint8_t battery_percent_from_mv(int32_t mv)
{
    if (mv >= 4200) return 100;
    if (mv >= 4100) return 90;
    if (mv >= 4000) return 80;
    if (mv >= 3900) return 70;
    if (mv >= 3800) return 60;
    if (mv >= 3700) return 50;
    if (mv >= 3600) return 35;
    if (mv >= 3500) return 20;
    if (mv >= 3400) return 10;
    if (mv >= 3300) return 5;
    return 0;
}

static int battery_read_mv(void)
{
    struct adc_sequence sequence = {0};
    int32_t mv;
    int err;

    if (!adc_is_ready_dt(&battery_adc)) {
        return -ENODEV;
    }

    err = adc_sequence_init_dt(&battery_adc, &sequence);
    if (err) {
        return err;
    }

    sequence.buffer = &battery_adc_raw;
    sequence.buffer_size = sizeof(battery_adc_raw);

    err = adc_read(battery_adc.dev, &sequence);
    if (err) {
        return err;
    }

    mv = battery_adc_raw;

    err = adc_raw_to_millivolts_dt(&battery_adc, &mv);
    if (err) {
        return err;
    }

    return (mv * BATTERY_VOLTAGE_DIVIDER_NUM + BATTERY_VOLTAGE_DIVIDER_DEN / 2) / BATTERY_VOLTAGE_DIVIDER_DEN;
}

static void battery_update_ble(void)
{
    int mv = battery_read_mv();

    if (mv < 0) {
        printk("Battery: read failed, err %d\n", mv);
        return;
    }
     printk("Battery debug: raw=%d, mv=%d\n", battery_adc_raw, mv);
    uint8_t percent = battery_percent_from_mv(mv);

    bt_bas_set_battery_level(percent);

    if (percent <= 20) {
        printk("Battery: LOW %d mV, %u%%\n", mv, percent);
    } else {
        printk("Battery: %d mV, %u%%\n", mv, percent);
    }
    printk("Battery: %d mV, %u%% - sent to BLE BAS\n", mv, percent);
}

static void battery_update_periodic(void)
{
    uint32_t now = k_uptime_get_32();

    if ((now - last_battery_update_time) >= BATTERY_UPDATE_INTERVAL_MS) {
        last_battery_update_time = now;
        battery_update_ble();
    }
}


/* Оновлена функція встановлення яскравості */
static void set_backlight(uint8_t percent, bool on) {
    if (!pwm_is_ready_dt(&backlight)) {
        return;
    }

    current_brightness = (percent > 100) ? 100 : percent;
    backlight_on = on;

    uint32_t pulse = 0;
    if (backlight_on) {
        pulse = (backlight.period * current_brightness) / 100;
    }

    int err = pwm_set_pulse_dt(&backlight, pulse);
    if (!backlight_on && gpio_is_ready_dt(&backlight_gpio)) {
        gpio_pin_configure_dt(&backlight_gpio, GPIO_OUTPUT_INACTIVE);
    }
    
    if (err && !backlight_on && gpio_is_ready_dt(&backlight_gpio)) {
        printk("Backlight: PWM off failed, forcing GPIO low\n");
    }
}

/* ========================================================================== *
 * INACTIVITY TIMER (k_work_delayable)
 * ========================================================================== */

/* Must define sleep_timeout_ms before using it */
#define NVS_SLEEP_MIN_ID 106
#define LOW_POWER_SYSTEM_OFF_TIMEOUT_MS (30U * 60U * 1000U)
static struct nvs_fs fs;

static inline uint32_t sleep_timeout_ms(void) {
    return (uint32_t)sleep_timeout_minutes * 60U * 1000U;
}

static void inactivity_timeout_handler(struct k_work *work)
{
    printk("Inactivity timeout fired\n");
    app_post_simple(APP_EVT_INACTIVITY_TIMEOUT);
}

static K_WORK_DELAYABLE_DEFINE(inactivity_work, inactivity_timeout_handler);

void inactivity_timer_init(void)
{
    /* Initialize work, do not schedule yet */
    printk("Inactivity timer initialized\n");
}

void inactivity_timer_reset(void)
{
    if (sleep_timeout_minutes == 0) {
        /* Sleep disabled */
        k_work_cancel_delayable(&inactivity_work);
        return;
    }

    uint32_t timeout_ms = sleep_timeout_ms();
    k_work_reschedule_for_queue(&k_sys_work_q, &inactivity_work, K_MSEC(timeout_ms));
#if DEBUG_INACTIVITY_LOG
    printk("Inactivity timer reset: %u ms\n", timeout_ms);
#endif
}

void inactivity_timer_reset_system_off_timeout(void)
{
    k_work_reschedule_for_queue(&k_sys_work_q, &inactivity_work,
                                K_MSEC(LOW_POWER_SYSTEM_OFF_TIMEOUT_MS));
#if DEBUG_INACTIVITY_LOG
    printk("Inactivity timer reset for system off: %u ms\n",
           LOW_POWER_SYSTEM_OFF_TIMEOUT_MS);
#endif
}

void inactivity_timer_stop(void)
{
    k_work_cancel_delayable(&inactivity_work);
}

static void power_force_app_peripherals_off(void);
static void prepare_wakeup_pins(void);

/* Forward declarations for power management functions */
void power_prepare_system_off(void);
void power_enter_system_off(void);

static void set_sleep_timeout_minutes(uint8_t minutes) {
    if (minutes > 120) {
        minutes = 120;
    }
    sleep_timeout_minutes = minutes;
    nvs_write(&fs, NVS_SLEEP_MIN_ID, &sleep_timeout_minutes, sizeof(sleep_timeout_minutes));
    printk("Power save: timeout set to %u min\n", sleep_timeout_minutes);
}

/* Weak symbol to allow linking even if main.c doesn't define it */
extern uint8_t active_connections __attribute__((weak));

static uint32_t nrf_pin_from_dt(const struct gpio_dt_spec *spec)
{
#if DT_NODE_HAS_STATUS(DT_NODELABEL(gpio1), okay)
    static const struct device *gpio1_dev = DEVICE_DT_GET(DT_NODELABEL(gpio1));

    if (spec->port == gpio1_dev) {
        return NRF_GPIO_PIN_MAP(1, spec->pin);
    }
#endif

    return NRF_GPIO_PIN_MAP(0, spec->pin);
}

static void force_backlight_off_for_sleep(void)
{
    backlight_on = false;

    if (pwm_is_ready_dt(&backlight)) {
        pwm_set_pulse_dt(&backlight, 0);
    }

    if (gpio_is_ready_dt(&backlight_gpio)) {
        gpio_pin_configure_dt(&backlight_gpio, GPIO_OUTPUT_INACTIVE);
        gpio_pin_set_dt(&backlight_gpio, 0);
    }

    printk("Power save: LED forced OFF before sleep\n");
}

static void power_force_app_peripherals_off(void)
{
    printk("Power save: forcing app peripherals OFF\n");

    force_backlight_off_for_sleep();

#ifdef NRF_PWM0
    NRF_PWM0->TASKS_STOP = 1;
    NRF_PWM0->ENABLE = 0;
#endif

#ifdef NRF_RADIO
    NRF_RADIO->TASKS_DISABLE = 1;
#endif

#ifdef NRF_QDEC
    NRF_QDEC->TASKS_STOP = 1;
    NRF_QDEC->ENABLE = 0;
#endif

#ifdef NRF_SAADC
    NRF_SAADC->TASKS_STOP = 1;
    NRF_SAADC->ENABLE = 0;
#endif

#ifdef NRF_GPIOTE
    NRF_GPIOTE->INTENCLR = 0xFFFFFFFF;
    for (uint8_t i = 0; i < 8; i++) {
        NRF_GPIOTE->CONFIG[i] = 0;
        NRF_GPIOTE->EVENTS_IN[i] = 0;
    }
    NRF_GPIOTE->EVENTS_PORT = 0;
#endif

    nrf_gpio_cfg_default(QDEC_A_PIN);
    nrf_gpio_cfg_default(QDEC_B_PIN);
    nrf_gpio_cfg_default(BATTERY_ADC_PIN);

    if (gpio_is_ready_dt(&backlight_gpio)) {
        uint32_t pin = nrf_pin_from_dt(&backlight_gpio);

