Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
        nrf_gpio_cfg_output(pin);
        nrf_gpio_pin_clear(pin);
    }

    printk("Power save: PWM/QDEC/SAADC stopped, non-wakeup pins disconnected\n");
}

/* Legacy function: power save mode entry (now delegated to app_sm) */
__attribute__((unused))
static void enter_power_save_mode(void) {
    if (power_save_active || sleep_timeout_minutes == 0) {
        return;
    }

    printk("Power save: timeout reached after %u min inactivity\n", sleep_timeout_minutes);

    app_post_simple(APP_EVT_PREPARE_SLEEP);
}

void power_prepare_system_off(void)
{
    backlight_was_on_before_sleep = backlight_on;

    printk("Power: Preparing for system off...\n");

    power_force_app_peripherals_off();

    /* Prepare pins for wakeup from system-off */
    prepare_wakeup_pins();

    printk("Power: Going to SYSTEM OFF now\n");
}

void power_enter_system_off(void)
{
    printk("Power: calling nrf_power_system_off()\n");
    nrf_power_system_off(NRF_POWER);

    /* Should never return. If it does, reboot to avoid repeated broken sleep loop */
    printk("Power ERROR: nrf_power_system_off() returned\n");
    k_msleep(100);
    sys_reboot(SYS_REBOOT_COLD);
}

/* Public input state query helpers for app_sm combo detection */

uint8_t input_keyboard_pressed_count(void) {
    uint8_t count = 0;
    for (int r = 0; r < NUM_ROWS; r++) {
        for (int c = 0; c < NUM_COLS; c++) {
            if (key_state[r][c]) {
                count++;
            }
        }
    }
    return count;
}

bool input_encoder_button_is_pressed(void) {
    return enc_btn_state;
}

bool input_combo_unpair_condition(void) {
    return enc_btn_state && input_keyboard_pressed_count() >= 2;
}

bool input_combo_unpair_already_done(void) {
    return combo_unpair_done;
}

void input_combo_unpair_set_done(bool done) {
    combo_unpair_done = done;
}

void input_scan_set_enabled(bool enabled)
{
    input_scan_enabled = enabled;
}

void input_enter_low_power_connected(void)
{
    if (power_save_active) {
        return;
    }

    power_save_active = true;
    backlight_was_on_before_sleep = backlight_on;
    force_backlight_off_for_sleep();
    printk("Power save: low-power connected mode entered\n");
}

void input_exit_low_power_connected(void)
{
    if (!power_save_active) {
        return;
    }

    power_save_active = false;

    if (backlight_was_on_before_sleep) {
        set_backlight(current_brightness, true);
    }

    printk("Power save: low-power connected mode exited\n");
}

/* --- Наші глобальні змінні для профілів --- */
static Profile_t profiles[MAX_PROFILES];      /* Масив усіх профілів у RAM (183 байти) */
static uint8_t active_profile_index = 0;      /* Індекс поточного профілю */

/* Цей макрос дозволить старому коду працювати без змін: 
   всюди, де написано current_profile, компілятор підставить profiles[active_profile_index] */
#define current_profile (profiles[active_profile_index])
/* ========================================================================== *
 * 1. МОДУЛЬ ПАМ'ЯТІ (NVS STORAGE)
 * Відповідає за збереження налаштувань між перезавантаженнями
 * ========================================================================== */
#define NVS_PARTITION		app_storage_partition
#define NVS_PARTITION_DEVICE	FIXED_PARTITION_DEVICE(NVS_PARTITION)
#define NVS_PARTITION_OFFSET	FIXED_PARTITION_OFFSET(NVS_PARTITION)
#define NVS_KEYMAP_ID 1

#define NVS_ACTIVE_PROF_ID 100
#define NVS_PROFILE_BASE_ID 300
#define NVS_LED_STATE_ID 105 /* Новий ID для збереження стану (ON/OFF) */
/* NVS base for sequences */
#define NVS_SEQUENCE_BASE_ID 400

/* ===== Sequences storage and types ===== */
#define MAX_SEQUENCES 8
#define SEQUENCE_NAME_LEN 16
#define SEQUENCE_MAX_STEPS 32

typedef struct __packed {
    uint8_t mod;
    uint8_t code;
    uint16_t delay_ms;
} SequenceStep_t;

typedef struct __packed {
    char name[SEQUENCE_NAME_LEN];
    uint8_t len;
    SequenceStep_t steps[SEQUENCE_MAX_STEPS];
} KeySequence_t; /* 16 + 1 + 32*4 = 145 bytes */

static KeySequence_t sequences[MAX_SEQUENCES];

/* Global variable to store max random delay for sequences (set by Alt+F15 at first step) */
static uint16_t sequence_random_max_ms = 0;

static void load_all_sequences(void) {
    for (uint8_t i = 0; i < MAX_SEQUENCES; i++) {
        int rc = nvs_read(&fs, NVS_SEQUENCE_BASE_ID + i, &sequences[i], sizeof(KeySequence_t));
        if (rc == sizeof(KeySequence_t)) {
            printk("Storage: Sequence %d loaded\n", i);
        } else {
            printk("Storage: Sequence %d not found, creating default\n", i);
            memset(&sequences[i], 0, sizeof(KeySequence_t));
            snprintf(sequences[i].name, SEQUENCE_NAME_LEN, "Seq %d", i + 1);
            sequences[i].len = 0;
            nvs_write(&fs, NVS_SEQUENCE_BASE_ID + i, &sequences[i], sizeof(KeySequence_t));
        }
    }
}

static void load_all_profiles(void) {
    for (uint8_t i = 0; i < MAX_PROFILES; i++) {
        /* Читаємо. rc - це кількість прочитаних байтів */
        int rc = nvs_read(&fs, NVS_PROFILE_BASE_ID + i, &profiles[i], sizeof(Profile_t));
        
        /* Профіль вважається дійсним, тільки якщо прочитано рівно 61 байт */
        if (rc == sizeof(Profile_t)) {
            printk("Storage: Profile %d loaded from Flash successfully!\n", i);
        } else {
            printk("Storage: Profile %d not found or invalid (rc=%d). Creating default...\n", i, rc);
            memset(&profiles[i], 0, sizeof(Profile_t));
            snprintf(profiles[i].name, PROFILE_NAME_LEN, "Profile %d", i + 1);
            
            profiles[i].matrix[0][0].type = ACTION_TYPE_KEY;
            profiles[i].matrix[0][0].code = 0x04 + i;
            
            profiles[i].enc_cw.type = ACTION_TYPE_MOUSE;
            profiles[i].enc_cw.code = 1; 
            profiles[i].enc_ccw.type = ACTION_TYPE_MOUSE;
            profiles[i].enc_ccw.code = (uint8_t)-1; 
            
            nvs_write(&fs, NVS_PROFILE_BASE_ID + i, &profiles[i], sizeof(Profile_t));
        }
    }
}

static void storage_init(void) {
    int rc;
    struct flash_pages_info info;

    fs.flash_device = NVS_PARTITION_DEVICE;
    if (!device_is_ready(fs.flash_device)) {
        printk("Storage Error: Flash device not ready\n");
        return;
    }

    fs.offset = NVS_PARTITION_OFFSET;
    rc = flash_get_page_info_by_offs(fs.flash_device, fs.offset, &info);
    if (rc) { return; }
    
