Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
    fs.sector_size = info.size;
    fs.sector_count = 3U;

    rc = nvs_mount(&fs);
    if (rc) {
        printk("Storage Error: Error mounting NVS\n");
        return;
    }
    /* 1. Читаємо індекс активного профілю */
    rc = nvs_read(&fs, NVS_ACTIVE_PROF_ID, &active_profile_index, sizeof(active_profile_index));
    if (rc <= 0 || active_profile_index >= MAX_PROFILES) {
        active_profile_index = 0; 
        nvs_write(&fs, NVS_ACTIVE_PROF_ID, &active_profile_index, sizeof(active_profile_index));
    }
    
    /* 2. Завантажуємо ВСІ профілі в масив у RAM */
    load_all_profiles();
    /* Завантажуємо всі послідовності */
    load_all_sequences();
    printk("Storage: Loaded all %d profiles. Active: %d\n", MAX_PROFILES, active_profile_index);

    uint8_t saved_sleep_min;
    rc = nvs_read(&fs, NVS_SLEEP_MIN_ID, &saved_sleep_min, sizeof(saved_sleep_min));
    if (rc > 0 && saved_sleep_min <= 120) {
        sleep_timeout_minutes = saved_sleep_min;
    }

    /* У функції storage_init */
    uint8_t saved_led_state;
    rc = nvs_read(&fs, NVS_LED_STATE_ID, &saved_led_state, sizeof(saved_led_state));
    if (rc > 0) {
        backlight_on = (bool)saved_led_state;
    }
    set_backlight(current_brightness, backlight_on);

    last_activity_time = k_uptime_get_32();
}


/* ========================================================================== *
 * 2. МОДУЛЬ BLUETOOTH HID (КЛАВІАТУРА ТА МИША)
 * Відповідає за передачу натискань в операційну систему
 * ========================================================================== */
enum { HIDS_REMOTE_WAKE = BIT(0), HIDS_NORMALLY_CONNECTABLE = BIT(1) };
struct hids_info { uint16_t version; uint8_t code; uint8_t flags; } __packed;
struct hids_report { uint8_t id; uint8_t type; } __packed;

static struct hids_info info = { .version = 0x0111, .code = 0x00, .flags = HIDS_NORMALLY_CONNECTABLE | HIDS_REMOTE_WAKE };
static struct hids_report input_kbd = { .id = 0x01, .type = 0x01 };
static struct hids_report input_mouse = { .id = 0x02, .type = 0x01 };
static uint8_t ctrl_point;

static uint8_t report_map[] = {
    /* КЛАВІАТУРА (Report ID 1) */
    0x05, 0x01, 0x09, 0x06, 0xA1, 0x01, 0x85, 0x01, 0x05, 0x07, 0x19, 0xE0, 0x29, 0xE7, 0x15, 0x00, 0x25, 0x01, 0x75, 0x01, 0x95, 0x08, 0x81, 0x02, 0x95, 0x01, 0x75, 0x08, 0x81, 0x01, 0x95, 0x06, 0x75, 0x08, 0x15, 0x00, 0x25, 0x65, 0x05, 0x07, 0x19, 0x00, 0x29, 0x65, 0x81, 0x00, 0xC0,
    /* МИШКА (Report ID 2) */
    0x05, 0x01, 0x09, 0x02, 0xA1, 0x01, 0x85, 0x02, 0x09, 0x01, 0xA1, 0x00, 0x05, 0x09, 0x19, 0x01, 0x29, 0x03, 0x15, 0x00, 0x25, 0x01, 0x95, 0x03, 0x75, 0x01, 0x81, 0x02, 0x95, 0x01, 0x75, 0x05, 0x81, 0x03, 0x05, 0x01, 0x09, 0x30, 0x09, 0x31, 0x15, 0x81, 0x25, 0x7F, 0x75, 0x08, 0x95, 0x02, 0x81, 0x06, 0x09, 0x38, 0x15, 0x81, 0x25, 0x7F, 0x75, 0x08, 0x95, 0x01, 0x81, 0x06, 0xC0, 0xC0
};

static ssize_t read_info(struct bt_conn *c, const struct bt_gatt_attr *a, void *b, uint16_t l, uint16_t o) { return bt_gatt_attr_read(c, a, b, l, o, a->user_data, sizeof(struct hids_info)); }
static ssize_t read_report_map(struct bt_conn *c, const struct bt_gatt_attr *a, void *b, uint16_t l, uint16_t o) { return bt_gatt_attr_read(c, a, b, l, o, report_map, sizeof(report_map)); }
static ssize_t read_report(struct bt_conn *c, const struct bt_gatt_attr *a, void *b, uint16_t l, uint16_t o) { return bt_gatt_attr_read(c, a, b, l, o, a->user_data, sizeof(struct hids_report)); }
static void input_ccc_changed(const struct bt_gatt_attr *a, uint16_t v) {}
static ssize_t read_input_report(struct bt_conn *c, const struct bt_gatt_attr *a, void *b, uint16_t l, uint16_t o) { return bt_gatt_attr_read(c, a, b, l, o, NULL, 0); }
static ssize_t write_ctrl_point(struct bt_conn *c, const struct bt_gatt_attr *a, const void *b, uint16_t l, uint16_t o, uint8_t f) { return l; }

BT_GATT_SERVICE_DEFINE(hog_svc,
    BT_GATT_PRIMARY_SERVICE(BT_UUID_HIDS),
    BT_GATT_CHARACTERISTIC(BT_UUID_HIDS_INFO, BT_GATT_CHRC_READ, BT_GATT_PERM_READ, read_info, NULL, &info),
    BT_GATT_CHARACTERISTIC(BT_UUID_HIDS_REPORT_MAP, BT_GATT_CHRC_READ, BT_GATT_PERM_READ, read_report_map, NULL, NULL),
    
    /* Attribute Index 6: Keyboard Report */
    BT_GATT_CHARACTERISTIC(BT_UUID_HIDS_REPORT, BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ_ENCRYPT, read_input_report, NULL, NULL),
    BT_GATT_CCC(input_ccc_changed, BT_GATT_PERM_READ_ENCRYPT | BT_GATT_PERM_WRITE_ENCRYPT),
    BT_GATT_DESCRIPTOR(BT_UUID_HIDS_REPORT_REF, BT_GATT_PERM_READ, read_report, NULL, &input_kbd),
    
    /* Attribute Index 10: Mouse Report */
    BT_GATT_CHARACTERISTIC(BT_UUID_HIDS_REPORT, BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ_ENCRYPT, read_input_report, NULL, NULL),
    BT_GATT_CCC(input_ccc_changed, BT_GATT_PERM_READ_ENCRYPT | BT_GATT_PERM_WRITE_ENCRYPT),
    BT_GATT_DESCRIPTOR(BT_UUID_HIDS_REPORT_REF, BT_GATT_PERM_READ, read_report, NULL, &input_mouse),
    
    BT_GATT_CHARACTERISTIC(BT_UUID_HIDS_CTRL_POINT, BT_GATT_CHRC_WRITE_WITHOUT_RESP, BT_GATT_PERM_WRITE, NULL, write_ctrl_point, &ctrl_point)
);

/* Універсальна функція для відправки і клавіатури, і миші */
/* External BLE helper used for HID guard */
extern bool ble_app_can_send_hid(void);

#define HID_RETRY_DELAY_MS 10

static void ble_send_hid_reports(void);
static void hid_retry_work_handler(struct k_work *work);

static bool hid_retry_pending;
static K_WORK_DELAYABLE_DEFINE(hid_retry_work, hid_retry_work_handler);

static void hid_schedule_retry(void)
{
    hid_retry_pending = true;
    k_work_reschedule(&hid_retry_work, K_MSEC(HID_RETRY_DELAY_MS));
}

static int hid_notify_checked(const struct bt_gatt_attr *attr,
                              const void *data,
                              uint16_t len,
                              const char *tag,
                              bool retry_current_state)
{
    int err = bt_gatt_notify(NULL, attr, data, len);

    if (err == -ENOMEM) {
        printk("HID WARN: %s notify ENOMEM, scheduling retry\n", tag);
        if (retry_current_state) {
            hid_schedule_retry();
        }
        return err;
    }

    if (err) {
        printk("HID ERROR: %s notify failed err=%d\n", tag, err);
    }

