Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
    return err;
}

static void hid_retry_work_handler(struct k_work *work)
{
    ARG_UNUSED(work);

    hid_retry_pending = false;

    if (ble_app_can_send_hid()) {
        ble_send_hid_reports();
    }
}

static void ble_send_hid_reports(void) {
    uint8_t kbd_report[8] = {0};
    int kbd_idx = 2; 
    
    uint8_t mouse_rep[4] = {0, 0, 0, 0}; /* [0]=Кнопки, [1]=X, [2]=Y, [3]=Скрол */

    /* Перевіряємо матрицю 3x4 */
    for (int r = 0; r < NUM_ROWS; r++) {
        for (int c = 0; c < NUM_COLS; c++) {
            if (key_state[r][c]) {
                Action_t act = current_profile.matrix[r][c];
                
                if (act.type == ACTION_TYPE_KEY) {
                    kbd_report[0] |= act.mod; 
                    if (kbd_idx < 8 && act.code != 0) kbd_report[kbd_idx++] = act.code; 
                }
                else if (act.type == ACTION_TYPE_MOUSE) {
                    /* Розшифровуємо ваші Flutter-коди у стандартні HID-біти */
                    if (act.code == 1) mouse_rep[0] |= BIT(0); /* Лівий клік */
                    if (act.code == 2) mouse_rep[0] |= BIT(1); /* Правий клік */
                    if (act.code == 3) mouse_rep[0] |= BIT(2); /* Середній клік */
                    if (act.code == 4) mouse_rep[3] = 1;       /* Скрол Вгору */
                    if (act.code == 5) mouse_rep[3] = (uint8_t)-1; /* Скрол Вниз */
                }
            }
        }
    }
    
    /* Перевіряємо кнопку енкодера */
    if (enc_btn_state) {
        Action_t act = current_profile.enc_btn;
        if (act.type == ACTION_TYPE_KEY) {
            kbd_report[0] |= act.mod;
            if (kbd_idx < 8 && act.code != 0) kbd_report[kbd_idx++] = act.code; 
        }
        else if (act.type == ACTION_TYPE_MOUSE) {
            if (act.code == 1) mouse_rep[0] |= BIT(0);
            if (act.code == 2) mouse_rep[0] |= BIT(1);
            if (act.code == 3) mouse_rep[0] |= BIT(2);
            if (act.code == 4) mouse_rep[3] = 1;
            if (act.code == 5) mouse_rep[3] = (uint8_t)-1;
        }
    }

    /* Відправляємо обидва звіти в ОС. 
       Коли ви відпустите кнопку, масиви будуть нульовими, 
       і ОС зрозуміє, що клік завершився. */
    hid_notify_checked(&hog_svc.attrs[6], kbd_report, sizeof(kbd_report),
                       "keyboard state", true);
    hid_notify_checked(&hog_svc.attrs[10], mouse_rep, sizeof(mouse_rep),
                       "mouse state", true);
}

/* HID send function called from app_sm */
void hid_send_current_input_state(void)
{
    if (!ble_app_can_send_hid()) {
        return;
    }

    ble_send_hid_reports();
}

static void input_send_encoder_mouse_wheel(Action_t act, bool clockwise, int steps)
{
    (void)clockwise;

    if (!ble_app_can_send_hid()) {
        return;
    }

    int wheel = 0;

    if (act.code == 4 || act.code == 1) {
        wheel = steps;
    } else if (act.code == 5 || act.code == (uint8_t)-1) {
        wheel = -steps;
    } else {
        return;
    }

    if (wheel > 7) {
        wheel = 7;
    } else if (wheel < -7) {
        wheel = -7;
    }

#if DEBUG_ENCODER_LOG
    printk("HID: encoder wheel=%d\n", wheel);
#endif

    uint8_t report[4] = {0, 0, 0, (uint8_t)((int8_t)wheel)};

    int err = hid_notify_checked(&hog_svc.attrs[10], report, sizeof(report),
                                 "encoder wheel", true);
    if (err) {
        return;
    }

#if ENCODER_WHEEL_SEND_RELEASE
    k_msleep(1);

    uint8_t release[4] = {0};
    hid_notify_checked(&hog_svc.attrs[10], release, sizeof(release),
                       "encoder wheel release", true);
#endif
}

static void input_send_encoder_key_pulse(Action_t act)
{
    if (!ble_app_can_send_hid() || act.code == 0) {
        return;
    }

    uint8_t report[8] = {0};
    report[0] = act.mod;
    report[2] = act.code;

    int err = hid_notify_checked(&hog_svc.attrs[6], report, sizeof(report),
                                 "encoder key press", true);
    if (err) {
        return;
    }

    k_msleep(1);

    uint8_t release[8] = {0};
    hid_notify_checked(&hog_svc.attrs[6], release, sizeof(release),
                       "encoder key release", true);
}

void input_execute_encoder_action(bool clockwise)
{
    Action_t act = clockwise ? current_profile.enc_cw : current_profile.enc_ccw;

#if DEBUG_ENCODER_LOG
    printk("HID: encoder %s action type=%u mod=%u code=%u\n",
           clockwise ? "CW" : "CCW", act.type, act.mod, act.code);
#endif

    if (act.type == ACTION_TYPE_MOUSE) {
        input_send_encoder_mouse_wheel(act, clockwise, 1);
        return;
    }

    if (act.type == ACTION_TYPE_KEY) {
        input_send_encoder_key_pulse(act);
        return;
    }

    if (act.type == ACTION_TYPE_SEQUENCE) {
        input_execute_sequence(act.code);
        return;
    }

    if (act.type == ACTION_TYPE_LIGHT) {
        handle_local_action(act);
        return;
    }
}

void input_execute_encoder_delta(int delta)
{
    if (delta == 0) {
        return;
    }

    bool clockwise = delta > 0;
    int steps = clockwise ? delta : -delta;
    Action_t act = clockwise ? current_profile.enc_cw : current_profile.enc_ccw;

#if DEBUG_ENCODER_LOG
    printk("HID: encoder delta=%d action type=%u mod=%u code=%u\n",
           delta, act.type, act.mod, act.code);
#endif

    switch (act.type) {
    case ACTION_TYPE_MOUSE:
        input_send_encoder_mouse_wheel(act, clockwise, steps);
        break;

    case ACTION_TYPE_KEY:
        if (steps > 4) {
            steps = 4;
        }

        for (int i = 0; i < steps; i++) {
            input_send_encoder_key_pulse(act);
        }
        break;

    case ACTION_TYPE_LIGHT:
        if (steps > 8) {
            steps = 8;
        }

        for (int i = 0; i < steps; i++) {
            handle_local_action(act);
        }
        break;

    case ACTION_TYPE_SEQUENCE:
        handle_local_action(act);
        break;

    case ACTION_TYPE_NONE:
    default:
        break;
    }
}

void input_handle_key_pressed(uint8_t row, uint8_t col)
{
    if (row >= NUM_ROWS || col >= NUM_COLS) {
        return;
    }

