Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
    handle_local_action(current_profile.matrix[row][col]);
}

void input_apply_profile_change(uint8_t profile_index)
{
    if (profile_index >= MAX_PROFILES) {
        return;
    }

    active_profile_index = profile_index;
    nvs_write(&fs, NVS_ACTIVE_PROF_ID, &active_profile_index, sizeof(active_profile_index));
    printk("BLE: Switched to profile %d\n", active_profile_index);
}

void input_apply_backlight_command(uint8_t value)
{
    if (value == 0) {
        set_backlight(current_brightness, false);
    } else {
        set_backlight(value, true);
    }

    uint8_t state_to_save = (value > 0) ? 1 : 0;
    nvs_write(&fs, NVS_LED_STATE_ID, &state_to_save, sizeof(state_to_save));
}

void input_apply_sleep_timeout(uint8_t minutes)
{
    set_sleep_timeout_minutes(minutes);
}

void input_execute_sequence(uint8_t sequence_index)
{
    if (sequence_index < MAX_SEQUENCES) {
        printk("Local: Execute sequence %d\n", sequence_index);
        execute_sequence(sequence_index);
    }
}

void input_handle_encoder_button_event(enum app_event_type type)
{
    bool pressed = (type == APP_EVT_ENCODER_BUTTON_PRESSED);

    if (pressed) {
        Action_t act = current_profile.enc_btn;

        if (act.type == ACTION_TYPE_LIGHT ||
            act.type == ACTION_TYPE_SEQUENCE) {
            handle_local_action(act);
        }
    }

    hid_send_current_input_state();
}

/* ========================================================================== *
 * 3. МОДУЛЬ КАСТОМНОГО СЕРВІСУ (ДЛЯ FLUTTER)
 * ========================================================================== */
#define MACROPAD_CONFIG_SERVICE_UUID BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef0)
#define MACROPAD_CHAR_INFO_UUID      BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef1)
#define MACROPAD_CHAR_DUMP_UUID      BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef2)
#define MACROPAD_CHAR_CTRL_UUID      BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef3)
#define MACROPAD_CHAR_SEQUENCES_UUID BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef4)
#define MACROPAD_CHAR_EXPORT_UUID    BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef5)

static struct bt_uuid_128 config_svc_uuid = BT_UUID_INIT_128(MACROPAD_CONFIG_SERVICE_UUID);
static struct bt_uuid_128 info_char_uuid = BT_UUID_INIT_128(MACROPAD_CHAR_INFO_UUID);
static struct bt_uuid_128 dump_char_uuid = BT_UUID_INIT_128(MACROPAD_CHAR_DUMP_UUID);
static struct bt_uuid_128 ctrl_char_uuid = BT_UUID_INIT_128(MACROPAD_CHAR_CTRL_UUID);
static struct bt_uuid_128 sequences_char_uuid = BT_UUID_INIT_128(MACROPAD_CHAR_SEQUENCES_UUID);
static struct bt_uuid_128 export_char_uuid = BT_UUID_INIT_128(MACROPAD_CHAR_EXPORT_UUID);

/* 1. Читання Info (Додаємо туди active_profile_index) */
/* 1. Читання Info (Додаємо туди інфо про наявність підсвітки) */
static ssize_t ble_flutter_read_info(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    char json_info[150];
    snprintf(json_info, sizeof(json_info), 
        "{\"ver\":\"1.0\",\"hw\":{\"rows\":3,\"cols\":4,\"enc\":1,\"led\":1},"
        "\"active_prof\":%d,\"led_on\":%d,\"led_val\":%d,\"sleep_min\":%u}", 
        active_profile_index, (int)backlight_on, current_brightness, sleep_timeout_minutes);
    
    return bt_gatt_attr_read(conn, attr, buf, len, offset, json_info, strlen(json_info));
}

/* 2. Читання ВСІХ профілів (183 байти) */
static ssize_t ble_flutter_read_dump(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    /* Віддаємо масив profiles цілком */
    return bt_gatt_attr_read(conn, attr, buf, len, offset, profiles, sizeof(profiles));
}

/* 3. Керування: Зміна профілю або Запис нових налаштувань */
static K_THREAD_STACK_DEFINE(seq_stack, 1024);
static struct k_thread seq_thread;

static void sequence_thread_fn(void *p1, void *p2, void *p3) {
    int idx = (int)(intptr_t)p1;
    if (idx < 0 || idx >= MAX_SEQUENCES) {
        return;
    }
    KeySequence_t *sq = &sequences[idx];
    
    uint8_t start_idx = 0;
    uint16_t max_random = 0;
    
    /* 1. ПЕРЕВІРКА ЗАГОЛОВКА РАНДОМІЗАЦІЇ (Alt + F15) */
    if (sq->len > 0) {
        SequenceStep_t *first = &sq->steps[0];
        
        /* Модифікатор Alt (0x04 або 0x40) */
        bool is_alt = (first->mod == 0x04 || first->mod == 0x40);
        
        /* Перевіряємо всі можливі варіанти коду F15 (децибел 72, хекс 0x48, 0x44 або стандартний HID 106/0x6A)
           щоб повністю синхронізуватися з Flutter */
        bool is_f15 = (first->code == 72 || first->code == 0x48 || first->code == 0x44 || first->code == 106 || first->code == 0x6A);
        
        if (is_alt && is_f15) {
            /* Перший крок — це конфігуратор. Беремо його delay_ms як максимальний рандом */
            max_random = first->delay_ms;
            start_idx = 1; /* Пропускаємо цей крок, не натискаємо його на ПК */
            printk("Sequence %d: Рандомізація увімкнена! Max random = %u ms (Alt+F15 пропущено)\n", idx, max_random);
        }
    }
    
    /* 2. ВИКОНАННЯ РЕАЛЬНИХ КРОКІВ ПОСЛІДОВНОСТІ */
    for (uint8_t i = start_idx; i < sq->len; i++) {
        SequenceStep_t *s = &sq->steps[i];
        
        uint16_t base_delay = s->delay_ms;
        uint16_t total_delay = base_delay;
        
        /* Якщо рандомізація активна, додаємо випадкове число від 0 до max_random */
        if (max_random > 0) {
            uint16_t random_offset = (uint16_t)(sys_rand32_get() % (max_random + 1));
            total_delay = base_delay + random_offset;
            printk("Sequence: Крок %u -> Базова: %u ms, Рандом: +%u ms, Чекаємо разом: %u ms\n", 
                   i, base_delay, random_offset, total_delay);
        } else {
            if (base_delay > 0) {
                printk("Sequence: Крок %u -> Чекаємо затримку: %u ms\n", i, total_delay);
            }
        }
        
        /* Спимо ПЕРЕД натисканням клавіші (чиста пре-затримка кроку) */
        if (total_delay > 0) {
            k_msleep(total_delay);
        }
        
