Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
        /* Натискаємо клавішу */
        uint8_t report[8] = {0};
        report[0] = s->mod;
        report[2] = s->code;

        /* Use hid_notify_checked to handle -ENOMEM and schedule retries if needed */
        int rc;
        int attempts = 0;
        do {
            rc = hid_notify_checked(&hog_svc.attrs[6], report, sizeof(report), "sequence key press", false);
            if (rc == -ENOMEM) {
                k_msleep(HID_RETRY_DELAY_MS);
            }
            attempts++;
        } while (rc == -ENOMEM && attempts < 10);

        /* Стандартне утримання кнопки (10 мс), щоб ОС встигла зафіксувати клік */
        k_msleep(10);

        /* Відпускаємо клавішу */
        uint8_t report_stop[8] = {0};
        attempts = 0;
        do {
            rc = hid_notify_checked(&hog_svc.attrs[6], report_stop, sizeof(report_stop), "sequence key release", false);
            if (rc == -ENOMEM) {
                k_msleep(HID_RETRY_DELAY_MS);
            }
            attempts++;
        } while (rc == -ENOMEM && attempts < 10);
    }
}

static void execute_sequence(uint8_t idx) {
    k_thread_create(&seq_thread, seq_stack, K_THREAD_STACK_SIZEOF(seq_stack), sequence_thread_fn,
                    (void *)(intptr_t)idx, NULL, NULL, K_PRIO_PREEMPT(7), 0, K_NO_WAIT);
}

static ssize_t ble_flutter_read_sequences(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    /* Return raw binary sequences array */
    return bt_gatt_attr_read(conn, attr, buf, len, offset, sequences, sizeof(sequences));
}

/* Use a static export buffer (avoid large stack usage) */
static char export_buf[4096];

static ssize_t ble_flutter_read_export(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    /* Build JSON export: active_profile, profiles, sequences */
    size_t used = 0;
    int ret = 0;
    size_t rem = sizeof(export_buf) - used;

    ret = snprintf(export_buf + used, rem, "{\"active_profile\":%d,\"profiles\":[", active_profile_index);
    if (ret < 0 || (size_t)ret >= rem) return 0;
    used += (size_t)ret;

    for (uint8_t p = 0; p < MAX_PROFILES; p++) {
        rem = sizeof(export_buf) - used;
        if (p) {
            ret = snprintf(export_buf + used, rem, ",");
            if (ret < 0 || (size_t)ret >= rem) return 0;
            used += (size_t)ret;
        }
        rem = sizeof(export_buf) - used;
        ret = snprintf(export_buf + used, rem, "{\"name\":\"%s\",\"matrix\":[", profiles[p].name);
        if (ret < 0 || (size_t)ret >= rem) return 0;
        used += (size_t)ret;

        for (int r = 0; r < NUM_ROWS; r++) {
            rem = sizeof(export_buf) - used;
            if (r) {
                ret = snprintf(export_buf + used, rem, ",");
                if (ret < 0 || (size_t)ret >= rem) return 0;
                used += (size_t)ret;
            }
            rem = sizeof(export_buf) - used;
            ret = snprintf(export_buf + used, rem, "[");
            if (ret < 0 || (size_t)ret >= rem) return 0;
            used += (size_t)ret;

            for (int c = 0; c < NUM_COLS; c++) {
                rem = sizeof(export_buf) - used;
                if (c) {
                    ret = snprintf(export_buf + used, rem, ",");
                    if (ret < 0 || (size_t)ret >= rem) return 0;
                    used += (size_t)ret;
                }
                Action_t a = profiles[p].matrix[r][c];
                rem = sizeof(export_buf) - used;
                ret = snprintf(export_buf + used, rem, "[%u,%u,%u]", a.type, a.mod, a.code);
                if (ret < 0 || (size_t)ret >= rem) return 0;
                used += (size_t)ret;
            }
            rem = sizeof(export_buf) - used;
            ret = snprintf(export_buf + used, rem, "]");
            if (ret < 0 || (size_t)ret >= rem) return 0;
            used += (size_t)ret;
        }
        rem = sizeof(export_buf) - used;
        ret = snprintf(export_buf + used, rem, ",\"enc_btn\":[%u,%u,%u],\"enc_cw\":[%u,%u,%u],\"enc_ccw\":[%u,%u,%u]}",
                       profiles[p].enc_btn.type, profiles[p].enc_btn.mod, profiles[p].enc_btn.code,
                       profiles[p].enc_cw.type, profiles[p].enc_cw.mod, profiles[p].enc_cw.code,
                       profiles[p].enc_ccw.type, profiles[p].enc_ccw.mod, profiles[p].enc_ccw.code);
        if (ret < 0 || (size_t)ret >= rem) return 0;
        used += (size_t)ret;
    }

    rem = sizeof(export_buf) - used;
    ret = snprintf(export_buf + used, rem, "],\"sequences\":[");
    if (ret < 0 || (size_t)ret >= rem) return 0;
    used += (size_t)ret;

    for (uint8_t sidx = 0; sidx < MAX_SEQUENCES; sidx++) {
        rem = sizeof(export_buf) - used;
        if (sidx) {
            ret = snprintf(export_buf + used, rem, ",");
            if (ret < 0 || (size_t)ret >= rem) return 0;
            used += (size_t)ret;
        }
        KeySequence_t *sq = &sequences[sidx];
        rem = sizeof(export_buf) - used;
        ret = snprintf(export_buf + used, rem, "{\"name\":\"%s\",\"len\":%u,\"steps\":[", sq->name, sq->len);
        if (ret < 0 || (size_t)ret >= rem) return 0;
        used += (size_t)ret;

        for (uint8_t si = 0; si < sq->len; si++) {
            rem = sizeof(export_buf) - used;
            if (si) {
                ret = snprintf(export_buf + used, rem, ",");
                if (ret < 0 || (size_t)ret >= rem) return 0;
                used += (size_t)ret;
            }
            SequenceStep_t *st = &sq->steps[si];
            rem = sizeof(export_buf) - used;
            ret = snprintf(export_buf + used, rem, "[%u,%u,%u]", st->mod, st->code, st->delay_ms);
            if (ret < 0 || (size_t)ret >= rem) return 0;
            used += (size_t)ret;
        }
        rem = sizeof(export_buf) - used;
        ret = snprintf(export_buf + used, rem, "]}");
        if (ret < 0 || (size_t)ret >= rem) return 0;
        used += (size_t)ret;
    }

    rem = sizeof(export_buf) - used;
    ret = snprintf(export_buf + used, rem, "]}");
    if (ret < 0 || (size_t)ret >= rem) return 0;
    used += (size_t)ret;

    return bt_gatt_attr_read(conn, attr, buf, len, offset, export_buf, used);
}

static ssize_t ble_flutter_write_ctrl(struct bt_conn *conn, const struct bt_gatt_attr *attr, const void *buf, uint16_t len, uint16_t offset, uint8_t flags) {
    const uint8_t *data = buf;
    printk("BLE: Received write packet, length: %d bytes\n", len);

