Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
    if (len == 1) {
        if (data[0] < MAX_PROFILES) {
            app_post_u8(APP_EVT_PROFILE_CHANGED, data[0]);
        }
        return len;
    }

    /* Short commands (2 bytes) */
    if (len == 2) {
        if (data[0] == 0xAA) {
            app_post_u8(APP_EVT_BACKLIGHT_CHANGED, data[1]);
            return len;
        } else if (data[0] == 0xAB) {
            app_post_u8(APP_EVT_SLEEP_TIMEOUT_CHANGED, data[1]);
            return len;
        } else if (data[0] == 0xB0) {
            uint8_t seq_idx = data[1] & 0x7F;
            if (seq_idx < MAX_SEQUENCES) {
                app_post_u8(APP_EVT_SEQUENCE_RUN_REQUESTED, seq_idx);
            }
            return len;
        }
    }

    /* Sequence write (0xB1) -> total length 147 bytes: [0xB1, seq_idx, KeySequence_t]
       Clear sequence (0xB2, seq_idx, 1) */
    if (len >= 2) {
        if (data[0] == 0xB1 && len == 147) {
            uint8_t seq_idx = data[1];
            if (seq_idx < MAX_SEQUENCES) {
                memcpy(&sequences[seq_idx], data + 2, sizeof(KeySequence_t));
                ssize_t w_rc = nvs_write(&fs, NVS_SEQUENCE_BASE_ID + seq_idx, &sequences[seq_idx], sizeof(KeySequence_t));
                if (w_rc < 0) printk("BLE ERROR: Failed to write sequence %d (err %d)\n", seq_idx, (int)w_rc);
                else printk("BLE: Sequence %d written\n", seq_idx);
            }
            return len;
        } else if (data[0] == 0xB2 && len >= 3) {
            uint8_t seq_idx = data[1];
            uint8_t flag = data[2];
            if (seq_idx < MAX_SEQUENCES && flag == 1) {
                memset(&sequences[seq_idx], 0, sizeof(KeySequence_t));
                nvs_write(&fs, NVS_SEQUENCE_BASE_ID + seq_idx, &sequences[seq_idx], sizeof(KeySequence_t));
                printk("BLE: Sequence %d cleared\n", seq_idx);
            }
            return len;
        }
    }

    /* Profile write: [profile_idx, Profile_t] */
    if (len >= sizeof(Profile_t) + 1) {
        uint8_t target_idx = data[0];
        if (target_idx < MAX_PROFILES) {
            memcpy(&profiles[target_idx], data + 1, sizeof(Profile_t));
            ssize_t w_rc = nvs_write(&fs, NVS_PROFILE_BASE_ID + target_idx, &profiles[target_idx], sizeof(Profile_t));
            if (w_rc < 0) {
                printk("BLE ERROR: Failed to write to Flash! Code: %d\n", (int)w_rc);
            } else {
                printk("BLE: Profile %d updated and saved (%d bytes written)\n", target_idx, (int)w_rc);
            }
        }
        return len;
    }

    printk("BLE ERROR: Invalid packet length or command. Received %d bytes\n", len);
    return len;
}

BT_GATT_SERVICE_DEFINE(macropad_config_svc,
    BT_GATT_PRIMARY_SERVICE(&config_svc_uuid),
    BT_GATT_CHARACTERISTIC(&info_char_uuid.uuid, BT_GATT_CHRC_READ, BT_GATT_PERM_READ_ENCRYPT, ble_flutter_read_info, NULL, NULL),
    BT_GATT_CHARACTERISTIC(&dump_char_uuid.uuid, BT_GATT_CHRC_READ, BT_GATT_PERM_READ_ENCRYPT, ble_flutter_read_dump, NULL, NULL),
    BT_GATT_CHARACTERISTIC(&sequences_char_uuid.uuid, BT_GATT_CHRC_READ, BT_GATT_PERM_READ_ENCRYPT, ble_flutter_read_sequences, NULL, NULL),
    BT_GATT_CHARACTERISTIC(&export_char_uuid.uuid, BT_GATT_CHRC_READ, BT_GATT_PERM_READ_ENCRYPT, ble_flutter_read_export, NULL, NULL),
    BT_GATT_CHARACTERISTIC(&ctrl_char_uuid.uuid, BT_GATT_CHRC_WRITE, BT_GATT_PERM_WRITE_ENCRYPT, NULL, ble_flutter_write_ctrl, NULL)
);

/* ========================================================================== *
 * 4. МОДУЛЬ HARDWARE
 * Ініціалізація та сканування фізичних кнопок та енкодера
 * Interrupt-based wake-up support
 * ========================================================================== */

/* GPIO Interrupt callbacks */
static struct gpio_callback button_cb_data;

static void button_pressed_callback(const struct device *dev, struct gpio_callback *cb, uint32_t pins) {
    printk("Hardware: Wakeup interrupt triggered on pins 0x%x\n", pins);
}

void input_disable_runtime_interrupts(void)
{
    if (device_is_ready(enc_btn.port)) {
        gpio_pin_interrupt_configure_dt(&enc_btn, GPIO_INT_DISABLE);
    }
}

static void hardware_init(void) {
    if (device_is_ready(enc_btn.port)) { 
        gpio_pin_configure_dt(&enc_btn, GPIO_INPUT | GPIO_PULL_UP);
        /* Setup interrupt for encoder button */
        gpio_init_callback(&button_cb_data, button_pressed_callback, BIT(enc_btn.pin));
        gpio_add_callback(enc_btn.port, &button_cb_data);
        gpio_pin_interrupt_configure_dt(&enc_btn, GPIO_INT_EDGE_TO_ACTIVE);
    }
    
    for (int i = 0; i < NUM_COLS; i++) { gpio_pin_configure_dt(&cols[i], GPIO_OUTPUT_INACTIVE); }
    for (int i = 0; i < NUM_ROWS; i++) { gpio_pin_configure_dt(&rows[i], GPIO_INPUT); }

    /* ДОДАНО: Запуск підсвітки */
    if (pwm_is_ready_dt(&backlight)) {
        printk("Hardware: PWM Backlight is ready!\n");
        set_backlight(current_brightness, backlight_on); 
    }
}

static void prepare_wakeup_pins(void) {
#if SYSTEM_OFF_WAKE_ON_MATRIX
    /* Matrix wake from SYSTEM OFF:
     * keep every column driven HIGH and arm SENSE on every row. Pressing any
     * key connects a column to a row, so any matrix key becomes a wake source.
     */
    for (int c = 0; c < NUM_COLS; c++) {
        uint32_t pin = nrf_pin_from_dt(&cols[c]);

        nrf_gpio_cfg_output(pin);
        nrf_gpio_pin_set(pin);
        printk("Power save: wake col %d configured pin %u output HIGH\n", c, pin);
    }

    for (int r = 0; r < NUM_ROWS; r++) {
        uint32_t pin = nrf_pin_from_dt(&rows[r]);

        nrf_gpio_cfg_sense_input(pin, NRF_GPIO_PIN_PULLDOWN, NRF_GPIO_PIN_SENSE_HIGH);
        printk("Power save: wake row %d configured pin %u sense HIGH\n", r, pin);
    }
#else
    for (int c = 0; c < NUM_COLS; c++) {
        nrf_gpio_cfg_default(nrf_pin_from_dt(&cols[c]));
    }

    for (int r = 0; r < NUM_ROWS; r++) {
        nrf_gpio_cfg_default(nrf_pin_from_dt(&rows[r]));
    }

    printk("Power save: matrix wake disabled for leakage test\n");
#endif

    /* Encoder button wake. The devicetree flag decides the active level. */
    if (device_is_ready(enc_btn.port)) {
        bool active_low = (enc_btn.dt_flags & GPIO_ACTIVE_LOW) != 0;
        uint32_t pin = nrf_pin_from_dt(&enc_btn);

        nrf_gpio_cfg_sense_input(
            pin,
            active_low ? NRF_GPIO_PIN_PULLUP : NRF_GPIO_PIN_PULLDOWN,
            active_low ? NRF_GPIO_PIN_SENSE_LOW : NRF_GPIO_PIN_SENSE_HIGH
        );
        printk("Power save: wake encoder button configured pin %u sense %s\n",
               pin,
               active_low ? "LOW" : "HIGH");
    }

    printk("Power save: all buttons armed as SYSTEM OFF wake sources\n");
}

/* ДОДАНО: Спільна функція для локальних дій (які виконуються самою платою, а не йдуть на ПК) */
static void handle_local_action(Action_t act) {
    if (act.type == ACTION_TYPE_LIGHT) {
        if (act.code == 1) { /* Більше */
            if (current_brightness <= 99) set_backlight(current_brightness + 1, true);
        } 
        else if (act.code == 2) { /* Менше */
            if (current_brightness >= 1) set_backlight(current_brightness - 1, true);
        }
        else if (act.code == 3) { /* Toggle ON/OFF */
            set_backlight(current_brightness, !backlight_on);
            uint8_t state_to_save = (uint8_t)backlight_on;
            nvs_write(&fs, NVS_LED_STATE_ID, &state_to_save, sizeof(state_to_save));
            printk("Backlight Toggle: %s\n", backlight_on ? "ON" : "OFF");
        }
    } else if (act.type == ACTION_TYPE_SEQUENCE) {
        input_execute_sequence(act.code);
    }
}

static bool hardware_scan_matrix(void) {
    bool state_changed = false;

    for (int c = 0; c < NUM_COLS; c++) {
        /* Drive one column active */
        gpio_pin_set_dt(&cols[c], 1);

        /* Small settling: a few NOP cycles to allow line to stabilise (very short, non-scheduler blocking)
         * This replaces k_busy_wait(30) to avoid long blocking delays. */
        for (volatile int i = 0; i < MATRIX_SETTLE_NOP_CYCLES; i++) {
            __asm__("nop");
        }

        for (int r = 0; r < NUM_ROWS; r++) {
            bool raw = (gpio_pin_get_dt(&rows[r]) == 1);

            /* If the raw reading is same as last raw, increment counter, else reset counter */
            if (raw == key_last_raw[r][c]) {
                if (key_debounce_count[r][c] < DEBOUNCE_STABLE_SCANS) {
                    key_debounce_count[r][c]++;
                }
            } else {
                key_debounce_count[r][c] = 1;
                key_last_raw[r][c] = raw;
            }

            /* If counter reached threshold and debounced state differs from exposed state, update */
            if (key_debounce_count[r][c] >= DEBOUNCE_STABLE_SCANS) {
                if (key_state[r][c] != key_last_raw[r][c]) {
                    key_state[r][c] = key_last_raw[r][c];
                    state_changed = true;

                    if (key_state[r][c]) {
                        printk("Input: Key pressed [%d,%d]\n", r, c);
                        app_post_key(APP_EVT_KEY_PRESSED, r, c);
                    } else {
                        printk("Input: Key released [%d,%d]\n", r, c);
                        app_post_key(APP_EVT_KEY_RELEASED, r, c);
                    }
                }
            }
        }

        gpio_pin_set_dt(&cols[c], 0);
    }

    /* Encoder button debouncing (polled) */
    if (device_is_ready(enc_btn.port)) {
        bool raw = (gpio_pin_get_dt(&enc_btn) > 0);

        if (raw == enc_btn_last_raw) {
            if (enc_btn_debounce_count < DEBOUNCE_STABLE_SCANS) enc_btn_debounce_count++;
        } else {
            enc_btn_debounce_count = 1;
            enc_btn_last_raw = raw;
        }

        if (enc_btn_debounce_count >= DEBOUNCE_STABLE_SCANS) {
            if (enc_btn_state != enc_btn_last_raw) {
                enc_btn_state = enc_btn_last_raw;
                state_changed = true;
                if (enc_btn_state) {
                    printk("Input: Encoder button pressed\n");
                    app_post_simple(APP_EVT_ENCODER_BUTTON_PRESSED);
                } else {
                    printk("Input: Encoder button released\n");
                    app_post_simple(APP_EVT_ENCODER_BUTTON_RELEASED);
                }
            }
        }
    }

    return state_changed;
}

static void hardware_scan_encoder(void)
{
    if (!device_is_ready(qdec_dev)) {
        return;
    }

    struct sensor_value val;

    if (sensor_sample_fetch(qdec_dev) != 0) {
        return;
    }

    if (sensor_channel_get(qdec_dev, SENSOR_CHAN_ROTATION, &val) != 0) {
        return;
    }

    if (val.val1 > 0) {
#if DEBUG_ENCODER_LOG
        printk("Input: Encoder CW\n");
#endif
        app_post_simple(APP_EVT_ENCODER_CW);
    } else if (val.val1 < 0) {
#if DEBUG_ENCODER_LOG
        printk("Input: Encoder CCW\n");
#endif
        app_post_simple(APP_EVT_ENCODER_CCW);
    }
}
/* ========================================================================== *
 * 5. ГОЛОВНИЙ ЦИКЛ ПРОГРАМИ
 * Об'єднує всі модулі разом
 * Sleep/Wake implementation with low power consumption
 * ========================================================================== */
K_THREAD_STACK_DEFINE(button_stack, 2048);
static struct k_thread button_thread;

