Xabyra/nRF52840-Macropad-Controller/Firmware/src/hog.c
void input_scan_init(void)
{
    /* Initialize input scanning thread */
    printk("Input: Initializing input scanning\n");
}

static void button_thread_fn(void *p1, void *p2, void *p3) {
    (void)p1; (void)p2; (void)p3;
    
    printk("\n--- Input Thread: Starting Hardware Scanning ---\n");
    
    /* Initialize storage and hardware */
    storage_init();
    hardware_init();
    battery_init();
    battery_update_ble();
    printk("Input: Hardware and storage initialized\n");

    /* Boot-time check for clear bonds combo (encoder button + 2+ matrix keys) */
    {
        int scan_count = 0;
        bool combo_active_at_boot = false;
        
        /* Do a few quick scans to detect if combo is pressed at boot */
        for (scan_count = 0; scan_count < 5; scan_count++) {
            hardware_scan_matrix();
            hardware_scan_encoder();
            
            if (input_combo_unpair_condition()) {
                combo_active_at_boot = true;
                printk("Input: Boot combo detected (encoder button + 2+ keys)\n");
                break;
            }
            
            k_msleep(50);
        }
        
        /* If combo active at boot and bonds not already cleared, clear them now */
        if (combo_active_at_boot) {
            printk("Input: Clear bonds requested during boot\n");
            app_post_simple(APP_EVT_CLEAR_BONDS_REQUESTED);
            
            /* Wait for button release before continuing */
            int release_wait = 0;
            while (input_combo_unpair_condition() && release_wait < 100) {
                hardware_scan_matrix();
                hardware_scan_encoder();
                k_msleep(50);
                release_wait++;
            }
            
            if (release_wait >= 100) {
                printk("Input: Boot combo timeout waiting for release\n");
            } else {
                printk("Input: Boot combo released, continuing boot\n");
            }
        }
    }

    /* Run button scanning in this dedicated thread */
    while (1) {
        
        if (input_scan_enabled) {
            if (hardware_scan_matrix()) {
                /* Events already posted by hardware_scan_matrix */
            }
            hardware_scan_encoder();

            battery_update_periodic();
            k_msleep(5);
        } else {
            k_msleep(100);
        }
    }
}

void hog_init(void) {}

void hog_button_loop(void) {
    static bool input_thread_started;

    if (input_thread_started) {
        return;
    }

    input_thread_started = true;

    /* Spawn button scanning as a separate thread so main thread can handle events */
    k_thread_create(&button_thread, button_stack, K_THREAD_STACK_SIZEOF(button_stack),
                    button_thread_fn, NULL, NULL, NULL, K_PRIO_COOP(7), 0, K_NO_WAIT);
    
    printk("Input: Button scanning thread started\n");
}
